app/controllers/curriculums_controller.rb

  def index
    @curriculums = Curriculum.all
---
SELECT `curriculums`.* FROM `curriculums`