app/controllers/curriculums_controller.rb

SELECT `curriculums`.* FROM `curriculums` WHERE `curriculums`.`user_id` = 8
---
  def index
    if logged_in? #testar se usuário logou
      @curriculums = Curriculum.where(user_id: session[:user_id]) #lista curriculums