app/controllers/schools_controller.rb

  def index
    if logged_in? #testar se usuário logou
        @schools=School.where(user_id: session[:user_id]) #lista escolas do usuario
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`user_id` = 8 LIMIT 1

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO `schools` (`name`, `cnpj`, `user_id`, `created_at`, `updated_at`) VALUES ('oia so', '78787878878', 8, '2016-03-17 12:59:17', '2016-03-17 12:59:17')

    def set_school
      @school = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = NULL LIMIT 1