app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'luizgrj' LIMIT 1
---
  def create
    user=User.find_by(username: params[:user][:username])