app/controllers/teachers_controller.rb

SELECT `teachers`.* FROM `teachers` WHERE `teachers`.`user_id` = 8
---
  def index
    if logged_in? #testar se usuário logou
        @teachers=Teacher.where(user_id: session[:user_id]) #lista escolas do usuario