app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT `teachers`.* FROM `teachers`

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO `teachers` (`name`, `cpf`, `user_id`, `created_at`, `updated_at`) VALUES ('john', '1122554544545', 8, '2016-03-17 13:58:22', '2016-03-17 13:58:22')

  def destroy
    @teacher.destroy
---
DELETE FROM `teachers` WHERE `teachers`.`id` = 1

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 1 LIMIT 1